(function () {
    const header = document.querySelector('.header')
    window.onscroll = () => {
        if (window.pageYOffset > 50) {
            header.classList.add('header_active')
        } else {
            header.classList.remove('header_active')
        }
    }
}());


// Burger handler

(function () {
    const burgerItem = document.querySelector('.burger');
    const menu = document.querySelector('.header__nav');
    const menuCloseItem = document.querySelector('.header__nav-close')
    burgerItem.addEventListener('click', () => {
        menu.classList.add('header__nav_active');
    });
    menuCloseItem.addEventListener('click', () => {
        menu.classList.remove('header__nav_active');
    });
}())

// Language switcher

const allLangs = ['ru', 'kz'];
let currentLang = localStorage.getItem("language") || checkBrowserLang() || 'ru';
const langButtons = document.querySelectorAll("[data-btn]");
const currentPathName = window.location.pathname;
let currentText = {};

const homeTexts = {
    "home_page-title": {
        ru: "№2 школа",
        kz: "№2 мектеп",
    },
    "home_page-main": {
        ru: "Главная",
        kz: "Басты бет",
    },
    "home_page-news": {
        ru: "Новости",
        kz: "Жаңалықтар",
    },
    "home_page-about": {
        ru: "О школе",
        kz: "Мектеп туралы",
    },
    "home_page-symbols": {
        ru: "Государственные символы",
        kz: "Мемлекеттік рәміздер",
    },
    "home_benefits-title": {
        ru: "Услуги №2 школы имени Каныша Сатпаева",
        kz: "Қаныш Сәтбаев атындағы №2 мектептің қызметтері",
    },
    "home_benefits-card-title1": {
        ru: "Добро пожаловать!",
        kz: "Қош келдіңіздер!",
    },
    "home_benefits-card-desc1": {
        ru: "Если у вас возникли вопросы, обращайтесь по телефону",
        kz: "Сұрақтарыңыз болса телефон арқылы хабарласыңыздар",
    },
    "home_benefits-card-more1": {
        ru: "Узнать больше",
        kz: "Толығырақ",
    },
    "home_top-card-more-1": {
        ru: "Узнать больше",
        kz: "Толығырақ",
    },
    "home_top-card-more-2": {
        ru: "Узнать больше",
        kz: "Толығырақ",
    },
    "home_top-card-more-3": {
        ru: "Узнать больше",
        kz: "Толығырақ",
    },
    "home_top-card-more-4": {
        ru: "Узнать больше",
        kz: "Толығырақ",
    },
    "home_top-card-more-5": {
        ru: "Узнать больше",
        kz: "Толығырақ",
    },
    "home_top-card-more-6": {
        ru: "Узнать больше",
        kz: "Толығырақ",
    },
    "home_benefits-card-title2": {
        ru: "Прием документов",
        kz: "Құжаттарды қабылдау",
    },
    "home_benefits-card-desc2": {
        ru: "Прием документов для зачисления в 1 класс через Egov портал",
        kz: "Egov порталы арқылы 1 сыныпқа құжаттарды қабылдау",
    },
    "home_benefits-card-more2": {
        ru: "Ссылка",
        kz: "Сілтеме",
    },
    "home_benefits-card-title3": {
        ru: "Директорский блог",
        kz: "Директор блогы",
    },
    "home_benefits-card-desc3": {
        ru: "Получайте интересные статьи и мнения от нашего директора о жизни школы",
        kz: "Директорымыздан мектеп өмірі туралы қызықты мақалалар мен пікірлерді алыңыз",
    },
    "home_benefits-card-more3": {
        ru: "Ссылка",
        kz: "Сілтеме",
    },
    "home_places-title": {
        ru: "Школьный альбом",
        kz: "Мектеп альбомы",
    },
    "galery_places-title": {
        ru: "Школьный альбом",
        kz: "Мектеп альбомы",
    },
    "home_places-view-all": {
        ru: "Посмотреть",
        kz: "Толығырақ",
    },
    "home_places-card1": {
        ru: "Школа",
        kz: "Мектеп",
    },
    "home_places-card2": {
        ru: "Актовый зал",
        kz: "Акт залы",
    },
    "home_places-card3": {
        ru: "Кабинет информатики",
        kz: "Информатика кабинеті",
    },
    "home_places-card4": {
        ru: "Спорт зал",
        kz: "Спорт залы",
    },
    "home_places-card5": {
        ru: "Кабинет биологии",
        kz: "Биология кабинеті",
    },
    "home_places-card6": {
        ru: "Круглый стол",
        kz: "Дөңгелек үстел",
    },
    "home_places-card7": {
        ru: "Стена слов",
        kz: "Сөздер қабырғасы",
    },
    "home_places-card8": {
        ru: "Кабинет истории",
        kz: "Тарих кабинеті",
    },
    "home_places-card9": {
        ru: "Кабинет НВП",
        kz: "АӘД кабинеті",
    },
    "home_places-card10": {
        ru: "Кабинет Химии",
        kz: "Химия кабинетіі",
    },
    "home_places-card11": {
        ru: "Кабинет Казахского языка",
        kz: "Қазақ тілі кабинеті",
    },
    "home_new-title1": {
        ru: "Основание школы",
        kz: "Мектептің құрылуы",
    },
    "home_new-desc1": {
        ru: "На основании решения горисполкома от 7 апреля 1964 года в селе Мирный был заложен фундамент средней школы № 2 на 960 мест. На правом берегу реки Иртыш, академика К. Сатпаева, 1-й и 2-й пригородных улиц строительные работы вело управление «Монтажжилстрой». Решением исполкома горсовета № 4-112 от 26 марта 1965 года в связи с полнотой учащихся школы № 9 и удаленностью от центра района была открыта Мирнинская сельская районная школа и получил название №2.",
        kz: "Қалалық атқару комитетінің 1964 жылғы 7 сәуірдегі шешімі негізінде Мирный ауылында 960 орындық № 2 орта мектептің іргетасы қаланды. Ертіс өзенінің оң жағалауында, академик Қ. Сәтбаевтың, 1-ші және 2-ші қала маңындағы көшелердің құрылыс жұмыстарын 'Монтажжилстрой' басқармасы жүргізді. Қалалық кеңес атқару комитетінің 1965 жылғы 26 наурыздағы № 4-112 шешімімен № 9 мектеп оқушыларының толықтығына және аудан орталығынан қашықтығына байланысты Мирнин ауылдық аудандық мектебі ашылып, №2 атауын алды.",
    },
    "home_new-title2": {
        ru: "История школы",
        kz: "Мектеп тарихы",
    },
    "home_new-desc2": {
        ru: "Школа №2 открыта 27 сентября 1965 года. По воспоминаниям старейшего учителя нашей школы - Сикардиной Надежды Ильиничны, на месте современного здания был заброшенный пустырь. А в поселке Мирном в нынешних бараках находилась начальная школа. Помещение было маленьким, поэтому большая часть детей обучалась в других школах, которые находились далеко от дома. Здание школы находится на правом берегу Иртыша на участке, ограниченном улицами: академика К. Сатпаева, Аккульской, 1-ой и 2-ой Загородними, по адресу: улица Сатпаева, 218. По воспоминаниям старожилов, первоначальное название улицы - «Трактовая». Базовым предприятием школы утвердили Кожмехобъединение, которое долгие годы шефствовало над учащимися и педагогами.",
        kz: "№2 мектеп 1965 жылы 27 қыркүйекте ашылды. Біздің мектептің ең көне мұғалімі - Сикардина Надежда Ильиничнаның естеліктеріне сәйкес, қазіргі ғимараттың орнында қараусыз қалған бос жер болған. Ал Мирный ауылында қазіргі казармада бастауыш мектеп болды. Бөлме кішкентай болды, сондықтан балалардың көпшілігі үйден алыс орналасқан басқа мектептерде оқыды. Мектеп ғимараты Ертістің оң жағалауында, академик Қ. Сәтбаев, Ақкөл, 1-ші және 2-ші Загородний көшелерімен Шектелген учаскеде, Сәтбаев көшесі, 218 мекенжайында орналасқан. Ескі адамдардың естеліктеріне сәйкес, көшенің бастапқы атауы - 'Трактовая'. Мектептің базалық кәсіпорны Қожмехобтың көптеген жылдар бойы оқушылар мен мұғалімдерге қамқор болған бірлігін бекітті.",
    },
    "home_top-title": {
        ru: "Новости",
        kz: "Жаңалықтар",
    },
    "home_top-view-all": {
        ru: "Посмотреть",
        kz: "Толығырақ",
    },
    "home_contact": {
        ru: "Обратная связь",
        kz: "Кері байланыс",
    },

    "footer-menu1-item1": {
        ru: "О школе",
        kz: "Мектеп туралы",
    },
    "footer-menu1": {
        ru: "Информация",
        kz: "Ақпарат",
    },
    "footer-menu1-item3": {
        ru: "Директорский блог",
        kz: "Директор блогы",
    },
    "footer-menu2-item1": {
        ru: "Улица Сатпаева, 218",
        kz: "Сәтпаев көшесі, 218",
    },
    "footer_social": {
        ru: "Социальные сети",
        kz: "Әлеуметтік желілер",
    },
    "footer_informations": {
        ru: "Информации",
        kz: "Ақпараттар",
    },
    "footer_location": {
        ru: "Локация",
        kz: "Мекен-жай",
    },
    "news_page-title": {
        ru: "Новости",
        kz: "Жаңалық",
    },
    "news_page-news": {
        ru: "Новости",
        kz: "Жаңалықтар",
    },
    "about_page-title": {
        ru: "О школе",
        kz: "Мектеп туралы",
    },
    "about_page-title": {
        ru: "О школе",
        kz: "Мектеп туралы",
    },
    "about_page-title-1": {
        ru: "О школе",
        kz: "Мектеп туралы",
    },
    "about_plan_title": {
        ru: "План школы на 5 лет",
        kz: "Мектеп жоспары 5 жылға",
    },
    "about_plan_title": {
        ru: "План школы на 5 лет",
        kz: "Мектеп жоспары 5 жылға",
    },
    "about_swot_title": {
        ru: "SWOT - анализ текущего положения школы",
        kz: "SWOT - мектептің қазіргі жағдайын талдау",
    },
    "about_teacher_title": {
        ru: "Преподаватели",
        kz: "Мұғалімдер",
    },
    "about_teacher": {
        ru: "Директор школы",
        kz: "Мектеп директоры",
    },
    "about_teacher-1": {
        ru: "Заместитель директора по воспитательной работе",
        kz: "Директордың тәрбие работе жөніндегі орынбасары",
    },
    "about_teacher-2": {
        ru: "Заместитель директора по учебной работе",
        kz: "Директордың оқу работе жөніндегі орынбасары",
    },
    "about_teacher-3": {
        ru: "Заместитель директора по учебной работе",
        kz: "Директордың оқу работе жөніндегі орынбасары",
    },
    "about_teacher-4": {
        ru: "Заместитель директора по воспитательной работе",
        kz: "Директордың тәрбие работе жөніндегі орынбасары",
    },
    "about_teacher-5": {
        ru: "Учитель начальных классов",
        kz: "Бастауыш сынып мұғалімі",
    },
    "about_teacher-6": {
        ru: "Учитель начальных классов",
        kz: "Бастауыш сынып мұғалімі",
    },
    "about_teacher-7": {
        ru: "Учитель начальных классов",
        kz: "Бастауыш сынып мұғалімі",
    },
    "symbol_start_title": {
        ru: "Государственнные символы",
        kz: "Мемлекеттік рәміздер",
    },
    "symbol_title": {
        ru: "Государственнные символы",
        kz: "Мемлекеттік рәміздер",
    },
    "text_title-1": {
        ru: "Государственный Флаг Республики Казахстан",
        kz: "Қазақстан Республикасының Мемлекеттік туы",
    },
    "text-desc-1": {
        ru: "Флаг – это один из главных символов государства, олицетворяющий его суверенитет и идентичность. Термин «флаг» происходит от нидерландского слова «vlag». Флаг — это прикрепленное к древку или шнуру полотнище установленных размеров и цветов, обычно с изображением на нем герба или эмблемы. С древних времен флаг выполнял функции объединения народа страны и его идентификации с определенным государственным образованием.",
        kz: "Ту — мемлекеттің егемендік пен біртұтастықты білдіретін басты рәміздерінің бірі. «Флаг» термині «vlag» деген нидерланд сөзінен шыққан және белгіленген көлем мен түстегі, әдетте елтаңба немесе эмблема түрінде бейнеленген, діңгекке немесе бауға бекітілген мата ұғымын білдіреді. Ту ежелден елдің халқын біріктіру және оны белгілі бір мемлекеттік құрылымға сәйкестендіру міндетін атқарып келеді.",
    },
    "text-desc-2": {
        ru: "Государственный флаг независимого Казахстана был официально принят в 1992 году. Его автором является художник Шакен Ниязбеков.",
        kz: "Тәуелсіз Қазақстанның Мемлекеттік туы ресми түрде 1992 жылы қабылданды. Оның авторы — белгілі суретші Шәкен Ниязбеков.",
    },
    "text-desc-3": {
        ru: "Государственный флаг Республики Казахстан представляет собой прямоугольное полотнище небесно-голубого цвета с изображением в центре солнца с лучами, под которым – парящий орел (беркут). У древка – вертикальная полоса с национальным орнаментом. Изображение солнца, его лучей, орла и национального орнамента – цвета золота. Соотношение ширины флага к его длине – 1: 2.",
        kz: "Қазақстан Республикасының Мемлекеттік туы — ортасында шұғылалы күн, оның астында қалықтап ұшқан қыран бейнеленген тік бұрышты көгілдір түсті мата. Тудың сабының тұсында тік жолақ түрінде ұлттық өрнек нақышталған. Күн, оның шұғыласы, қыран және ұлттық өрнек бейнесі алтын түстес. Тудың ені мен ұзындығының арақатынасы — 1:2",
    },
    "text-desc-4": {
        ru: "В традициях геральдики каждый цвет символизирует определенное понятие. Так, небесно-голубой цвет символизирует честность, верность и безупречность. Кроме того, небесно-голубой цвет имеет глубокое символическое значение в тюркской культуре. Древние тюрки всегда почитали небо своим богом-отцом, а их небесно-голубое знамя символизировало преданность отцу-прародителю. На государственном флаге Казахстана он символизирует чистое небо, мир и благополучие, а одноцветие фона – единство нашей страны.",
        kz: "Геральдика дәстүрінде әрбір түс белгілі бір ұғымды танытады. Мәселен, аспандай көк түс адам бойындағы адалдық, тазалық, сенімділік, мінсіздік сияқты қасиеттерді білдіреді. Сонымен қатар, көк түс түркі мәдениетінде терең символдық мәнге ие. Ежелгі түркілер аспанды тәңір-атаға балаған, ал олардың көк туы арғы ата-бабаларға деген адалдықты бейнеледі. Қазақстанның Мемлекеттік туында ол ашық аспанды, бейбітшілікті, игілікті білдірсе, түстің біркелкілігі еліміздің тұтастығын меңзейді.",
    },
    "text-desc-5": {
        ru: "Исходя из геральдических канонов, солнце символизирует богатство и изобилие, жизнь и энергию. Поэтому лучи солнца на флаге страны имеют форму зерна – символа достатка и благополучия. Изображение солнца в государственной атрибутике Казахстана подтверждает его приверженность общечеловеческим ценностям и свидетельствует о том, что новое молодое государство полно жизнеутверждающей энергии и открыто всем странам мира для партнерства и сотрудничества.",
        kz: "Геральдикалық канондарға сүйене отырып, күн байлық пен молшылықты, өмір мен энергияны білдіреді. Сондықтан елдің туындағы күн сәулелері дән тәрізді-өркендеу мен әл-ауқаттың символы. Қазақстанның мемлекеттік атрибутикасындағы күннің бейнесі оның жалпыадамзаттық құндылықтарға бейілділігін растайды және жаңа жас мемлекеттің өмірді растайтын энергияға толы екенін және әлемнің барлық елдеріне серіктестік пен ынтымақтастық үшін ашық екенін айғақтайды.",
    },
    "text-desc-6": {
        ru: "Образ орла (беркута) является одним из главных геральдических атрибутов, издавна применяемых в гербах и флагах многих народов. Этот образ обычно воспринимается как символ власти, прозорливости и великодушия. Парящий под солнцем беркут олицетворяет собой силу государства, его суверенитет и независимость, стремление к высоким целям и устойчивому будущему. Особое место занимает образ беркута в мировоззрении евразийских кочевников. Он ассоциируется у них с такими понятиями как свобода и верность, чувство достоинства и мужество, мощь и чистота помыслов. Стилизованный силуэт золотого беркута отражает стремление молодого суверенного государства к высотам мировой цивилизации.",
        kz: "Қыран (бүркіт) бейнесі — көптеген халықтардың елтаңбалары мен туларында ерте кезден бері қолданылып келе жатқан басты геральдикалық атрибуттардың бірі. Бұл бейне әдетте биліктің, қырағылық пен мәрттіктің символы ретінде қабылданады. Күн астында қалықтаған бүркіт мемлекеттің қуат-күшін, оның егемендігі мен тәуелсіздігін, биік мақсаттар мен жарқын болашаққа деген ұмтылысын танытады. Бүркіт бейнесі еуразиялық көшпенділердің дүниетанымында айрықша орын алады және олардың түсінігінде бостандық пен адалдық, өрлік пен ерлік, қуат пен ниет тазалығы тәрізді ұғымдармен ұштасып жатады. Алтын бүркіт кескіні жас егемен мемлекеттің әлемдік өркениет биігіне деген ұмылысын көрсетеді.",
    },
    "text-desc-7": {
        ru: "Важным элементом государственного флага является расположенная у его древка вертикальная полоса с национальным орнаментом. Казахский орнамент – одна из форм специфического художественного восприятия мира в строгом соответствии с эстетическими вкусами народа. Представляющий собой гармонию различных форм и линий, он является выразительным средством раскрытия внутреннего мира народа. Национальный орнамент вдоль древка символизирует культуру и традиции народа Казахстана.",
        kz: "Мемлекеттік тудың сабының тұсына тігінен ұзына бойына кескінделген ұлттық өрнектер — оның маңызды элементі. Қазақ ою-өрнектері — дүниені көркемдік тұрғыдан қабылдаудың халықтың эстетикалық талғамына сай келетін ерекше бір түрі. Түрлі формалар мен желілер үйлесімін танытатын өрнектер халықтың ішкі әлемін ашып көрсететін мәнерлі көркемдік құрал болып саналады. Тудың сабын жағалай салынған ұлттық өрнектер Қазақстан халқының мәдениеті мен дәстүрін символдық тұрғыда бейнелейді.",
    },
    "gerb_title": {
        ru: "Государственный герб Республики Казахстан",
        kz: "Қазақстан Республикасының Мемлекеттік елтаңбасы",
    },
    "gerb_desc-1": {
        ru: "Герб – один из главных символов государства. Термин «герб» происходит от немецкого слова «erbe» (наследство) и означает наследственный отличительный знак – сочетание фигур и предметов, которым придается символическое значение.",
        kz: "Елтаңба — мемлекеттің басты рәміздерінің бірі. Елтаңба («герб») термині немістің «erbe» (мұра) деген сөзінен шыққан. Мемлекеттің мәдени және тарихи дәстүрін бейнелейтін символдық мәні бар үйлесімді пішіндер мен заттардың мирастық ерекшелік белгісін білдіреді.",
    },
    "gerb_desc-2": {
        ru: "История свидетельствует, что еще кочевники эпохи бронзы, проживавшие на территории современного Казахстана, идентифицировали себя с особым символом – тотемом, графическое выражение которого впоследствии получило наименование «тамга». Впервые данный термин начал употребляться в Тюркском каганате.",
        kz: "Қазіргі Қазақстан аумағын мекендеген қола дәуірінің көшпенділері кейін графикалық ұғымы «таңба» деп аталған ерекше символ-тотем арқылы өздерін танытқанына тарих куәлік етіп отыр. Алғаш рет бұл термин Түрік қағанаты тұсында қолданыла бастаған.",
    },
    "gerb_desc-3": {
        ru: "Герб суверенного Казахстана был официально принят в 1992 году. Его авторами являются известные архитекторы Жандарбек Малибеков и Шот-Аман Уалиханов.",
        kz: "Егеменді Қазақстанның Елтаңбасы 1992 жылы ресми түрде қабылданды. Оның авторлары — белгілі сәулетшілер Жандарбек Мәлібеков пен Шот-Аман Уәлиханов.",
    },
    "gerb_desc-4": {
        ru: "Государственный герб Республики Казахстан имеет форму круга (колеса) – это символ жизни и вечности, который пользовался особым почетом среди кочевников Великой степи.",
        kz: "Қазақстан Республикасының Мемлекеттік елтаңбасы дөңгелек нысанды. Бұл — Ұлы дала көшпенділері айрықша қастер тұтқан өмір мен мәңгіліктің символы.",
    },
    "gerb_desc-5": {
        ru: "Центральным геральдическим элементом в государственном гербе является изображение шанырака (верхняя сводчатая часть юрты) на голубом фоне, от которого во все стороны в виде солнечных лучей расходятся уыки (опоры). Справа и слева от шанырака расположены изображения мифических крылатых коней. В верхней части находится объемная пятиконечная звезда, а в нижней части надпись «Qazaqstan». Изображение звезды, шанырака, уыков, мифических коней, а также надписи «Qazaqstan» – выполнены в цвете золота.",
        kz: "Мемлекеттік елтаңбаның орталық геральдикалық элементі — көгілдір түс аясындағы шаңырақ (киіз үйдің жоғарғы күмбез тәрізді бөлігі) бейнесі. Шаңырақты айнала күн сәулесі секілді тараған уықтар шаншылған. Шаңырақтың оң жағы мен сол жағына аңыздардағы қанатты пырақтар бейнесі орналастырылған. Жоғарғы бөлігінде – көлемді бес бұрышты жұлдыз, ал төменгі бөлігінде «Qazaqstan» деген жазу бар. Жұлдыздың, шаңырақтың, уықтардың, аңыздардағы қанатты пырақтардың бейнесі, сондай-ақ «Qazaqstan» деген жазу — алтын түстес.",
    },
    "gerb_desc-6": {
        ru: "Шанырақ – это главная системообразующая часть юрты, по форме напоминающая небесный купол и являющаяся одним из ключевых элементов жизнеустройства в традиционной культуре евразийских кочевников. В Государственном гербе республики образ шанырака – это символ общего дома и единой Родины для всех народов, проживающих в стране. Стабильное развитие Казахстана зависит от благополучия каждого гражданина, как прочность и устойчивость шанырака зависит от надежности всех его уыков (опор).",
        kz: "Көк күмбезін еске салатын және Еуразия көшпенділерінің дәстүрлі мәдениетінде тіршіліктің негізгі бастауының бірі боп саналатын шаңырақ – киіз үйдің басты жүйе құраушы бөлігі. Республиканың Мемлекеттік елтаңбасындағы шаңырақ бейнесі — елімізді мекендейтін барлық халықтардың ортақ қонысының, біртұтас Отанының символы. Шаңырақтың мықтылығы мен беріктігі оның барлық уықтарының сенімділігіне байланыстылығы секілді, Қазақстанда бақытқа жету әрбір азаматтың аман-есендігіне байланысты.",
    },
    "gerb_desc-7": {
        ru: "Крылатые мифические кони – тулпары в государственном гербе являются ключевым геральдическим элементом. Образ коня с незапамятных времен олицетворяет такие понятия, как храбрость, верность и силу. Крылья символизируют многовековую мечту многонационального народа Казахстана о построении сильного и процветающего государства. Они свидетельствуют о чистых помыслах и стремлении к последовательному совершенствованию и созидательному развитию. Золотые крылья скакунов напоминают также золотые колосья и олицетворяют собой трудолюбие казахстанцев и материальное благополучие страны.",
        kz: "Аңыздағы қанатты тұлпарлар Мемлекеттік елтаңбадағы өзекті геральдикалық элемент болып саналады. Бағзы замандағы тұлпар бейнесі батылдықты, сенімділікті және ерік күшін танытады. Пырақтың қанаты Қазақстанның көпұлтты халқының қуатты және гүлденген мемлекет құру туралы ғасырлар бойғы тілегін аңғартады. Олар — шынайы ой-арман мен ұдайы жетілуге және жасампаз дамуға ұмтылыстың көрінісі. Сонымен қатар, арғымақтың алтын қанаттары алтын масақты еске салады, қазақстандықтардың еңбексүйгіштігін және еліміздің материалдық игілігін танытады.",
    },
    "gerb_desc-8": {
        ru: "В прошлые века рога активно использовались в культовых обрядах кочевников, а также в качестве навершия их боевых стягов. Изображения небесной благодати, земного плодородия и воинской удачи в виде рогов различных животных всегда занимали значимые места в символических композициях различных народов. Таким образом, крылатый конь с рогом изобилия является важным типологическим образом, который имеет глубокие семантические и исторические корни.",
        kz: "Өткен ғасырларда мүйіз көшпенділердің табынушылық ғұрыптарында, сонымен қатар, жауынгерлік тудың ұшына орнату үшін белсенді пайдаланылған. Көктің сыйын, жердің игілігін, жорықтың жеңісін әртүрлі жануарлардың мүйізі арқылы бейнелеу көптеген халықтардың символдық композицияларында елеулі орын алды. Сондықтан молшылық әкелетін мүйізі бар қанатты тұлпар семантикалық және тарихи түп-тамыры терең маңызды типологиялық образ болып саналады.",
    },
    "gerb_desc-9": {
        ru: "Еще одна деталь в государственном гербе республики – пятиконечная звезда. Данный символ используется человечеством с давних времен и олицетворяет постоянное стремление людей к свету истины, ко всему возвышенному и вечному. Изображение звезды в государственном гербе отражает желание казахстанцев созидать страну, открытую для сотрудничества и партнерства со всеми народами мира. Сердца и объятия жителей Казахстана открыты представителям всех пяти континентов.",
        kz: "Республиканың Мемлекеттік елтаңбасындағы тағы бір деталь — бес бұрышты жұлдыз. Бұл символды адамзат ежелгі заманнан бері пайдаланып келеді, ол адамдардың ақиқат сәулесіне, барлық игі аңсарларға және мәңгілік құндылықтарға деген ұдайы ұмтылысын білдіреді. Мемлекеттік елтаңбада жұлдыздың бейнеленуі қазақстандықтардың әлемнің барлық халықтарымен ынтымақтастық пен серіктестік орнатуға ниетті ел болуға деген талпынысын танытады. Қазақстан тұрғындарының жүрегі мен құшағы бес құрлықтың өкілдері үшін қашанда ашық.",
    },
    "gerb_desc-10": {
        ru: "Основным цветом, используемым в государственном гербе, является цвет золота, который служит символом богатства, справедливости и великодушия. Также присутствует цвет флага – небесно-голубой, который гармонирует с цветом золота и символизирует чистое небо, мир и благополучие.",
        kz: "Елтаңбада қолданылған негізгі түс — алтынның түсі. Бұл — байлықтың, әділдіктің және кеңпейілділіктің символы. Сонымен қатар, көгілдір аспан түстес тудың түсі алтынның түсімен үйлесім тауып, ашық аспан, бейбітшілік және бақуат тіршілік ұғымдарын танытып тұр.",
    },
    "anthem_title": {
        ru: "Государственный гимн Республики Казахстан",
        kz: "Қазақстан Республикасының Мемлекеттік гимні",
    },
    "anthem_desc-1": {
        ru: "Гимн – это один из главных символов государства. Сам термин «гимн» происходит от греческого слова «gimneo» и означает «торжественная песня». Гимн выступает в качестве важной звуковой символики, имеющей ключевое значение для эффективной социально-политической консолидации и этнокультурной идентификации граждан страны.",
        kz: "Гимн — мемлекеттің басты рәміздерінің бірі. Гректің «gimneo» сөзінен шыққан «гимн» термині «салтанатты ән» деген мағынаны білдіреді. Гимн ел азаматтарын тиімді әлеуметтік-саяси тұрғыдан топтастырып, этномәдени тұрғыдан теңдестіру үшін негізгі мәнге ие, маңызды дыбыстық рәміз саналады.",
    },
    "anthem_desc-2": {
        ru: "В истории независимого Казахстана государственный гимн страны утверждался дважды – в 1992 и в 2006 годах.",
        kz: "Тәуелсіз Қазақстанның тарихында еліміздің мемлекеттік гимні екі рет — 1992 және 2006 жылдары бекітілді.",
    },
    "anthem_desc-3": {
        ru: "После обретения республикой государственного суверенитета в 1992 году был объявлен конкурс на музыку и текст гимна Казахстана. По итогам конкурса было принято решение сохранить музыкальную редакцию гимна Казахской ССР. Таким образом, авторами музыки первого казахстанского гимна стали Мукан Тулебаев, Евгений Брусиловский и Латиф Хамиди. В конкурсе на лучший текст также победил авторский коллектив, представленный известными поэтами: Музафаром Алимбаевым, Кадыром Мырзалиевым, Туманбаем Молдагалиевым и поэтессой Жадырой Дарибаевой.",
        kz: "Республика мемлекеттік егемендігін иеленгеннен кейін, 1992 жылы Қазақстан әнұранының музыкасы мен мәтініне байқау жарияланды. Байқау қорытындысы бойынша Қазақ КСР гимнінің музыкалық редакциясын сақтау туралы шешім қабылданды. Осылайша тәуелсіз Қазақстанның алғашқы гимінің музыкасының авторлары Мұқан Төлебаев, Евгений Брусиловский және Латиф Хамиди болды. Сонымен қатар, үздік мәтінге жарияланған байқауда авторлар ұжымы, белгілі ақындар Мұзафар Әлімбаев, Қадыр Мырзалиев, Тұманбай Молдағалиев және Жадыра Дәрібаева жеңіп шықты.",
    },
    "anthem_desc-4": {
        ru: "В целях популяризации звуковой символики страны в 2006 году был принят новый государственный гимн. Его основой стала популярная в народе патриотическая песня «Менiң Қазақстаным». Она была написана в 1956 году Шамши Калдаяковым на стихи Жумекена Нажимеденова. Для придания песне высокого статуса государственного гимна и более торжественного звучания Первый Президент Казахстана — Елбасы Нурсултан Назарбаев доработал первоначальный текст. Парламент Казахстана на совместном заседании палат 6 января 2006 года внес соответствующие поправки в Указ «О государственных символах» и утвердил новый государственный гимн страны.",
        kz: "Елдің дыбыстық рәмізінің танымалдығын арттыру мақсатында 2006 жылы жаңа мемлекеттік гимн қабылданды. Оның негізі ретінде халықтың арасында кеңінен танымал «Менің Қазақстаным» патриоттық әні таңдап алынды. Ол әнді Шәмші Қалдаяқов 1956 жылы Жұмекен Нәжімеденовтің сөзіне жазған болатын. Қазақстанның Тұңғыш Президенті – Елбасы Нұрсұлтан Назарбаев әнге мемлекеттік гимн жоғары мәртебесін беру және анағұрлым салтанатты шырқалуы үшін музыкалық туындының бастапқы мәтінін өңдеді. Қазақстан Парламенті 2006 жылы 6 қаңтарда палаталардың бірлескен отырысында «Мемлекеттік рәміздер туралы» Жарлыққа тиісті түзету енгізіп, еліміздің жаңа мемлекеттік гимнін бекітті.",
    },
    "anthem_desc-5": {
        ru: "Гимн Республики Казахстан",
        kz: "Қазақстан Республикасының гимні",
    },
    "anthem_pripev": {
        ru: "Припев:",
        kz: "Қайырмасы:",
    },
    "anthem_pripev-1": {
        ru: "Припев:",
        kz: "Қайырмасы:",
    },
};


function checkPagePathName() {
    switch (currentPathName) {
        case "/index.html":
            currentText = homeTexts;
            break;
        case "/news.html":
            currentText = newsTexts;
            break;

        default:
            currentText = homeTexts;
            break;
    }
}
checkPagePathName();

function changeLang() {
    for (const key in currentText) {
        const elem = document.querySelector(`[data-lang=${key}]`);
        if (elem) {
            elem.textContent = currentText[key][currentLang];
        }
    }
}
changeLang();

langButtons.forEach((btn)=>{
    btn.addEventListener('click', (event)=>{
        currentLang = event.target.dataset.btn;
        localStorage.setItem("language", event.target.dataset.btn)
        resetActiveClass(langButtons, "header__btn_active");
        btn.classList.add('header__btn_active');
        changeLang();
    });
});

function resetActiveClass(arr, activeClass){
    arr.forEach(elem=>{
        elem.classList.remove(activeClass)
    })
}

function checkActiveLangButton() {
    switch (currentLang) {
        case 'ru':
            document
                .querySelector('[data-btn="ru"]')
                .classList.add("header__btn_active");
        break;
        case 'kz':
            document
                .querySelector('[data-btn="kz"]')
                .classList.add("header__btn_active");
        break;

        default:
            document
                .querySelector('[data-btn="ru"]')
                .classList.add("header__btn_active");
        break;
    }
}
checkActiveLangButton();

function checkBrowserLang(){
    const navLang = navigator.language.slice(0, 2).toLowerCase
    const result = allLangs.some(elem=>{
        return elem === navLang;
    })

    if(result){
        return navLang
    }
}

console.log("navigator.language", checkBrowserLang());